# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'1.3.4'

### Creating Series

In [3]:
list1 = ['a','b','c']
list2 = [20,30,40]
arr = np.array ([30,80,35])
dict1 = {'a':10,'b':20,'c':30}

In [4]:
# creating series using lists
pd.Series (data = list2)

0    20
1    30
2    40
dtype: int64

In [5]:
pd.Series (data = list2, index=list1)

a    20
b    30
c    40
dtype: int64

In [6]:
pd.Series (list2,list1)

a    20
b    30
c    40
dtype: int64

In [7]:
# creating series using numpy arrays
pd.Series (arr)

0    30
1    80
2    35
dtype: int32

In [8]:
pd.Series (arr,list1)

a    30
b    80
c    35
dtype: int32

In [9]:
# creating series using dictionary 
pd.Series (dict1)

a    10
b    20
c    30
dtype: int64

In [10]:
dict1

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series (list1)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series (['list1', 15, 'jkdgsf'],list1)

a     list1
b        15
c    jkdgsf
dtype: object

### Using Series Index

In [13]:
ser1 = pd.Series([1,2,3,4],index = ['Google', 'Facebook','Apple', 'Microsoft'])
ser2 = pd.Series([1,2,5,4],index = ['Google', 'Facebook','Nvidia', 'Microsoft'])

In [14]:
ser1

Google       1
Facebook     2
Apple        3
Microsoft    4
dtype: int64

In [15]:
ser2

Google       1
Facebook     2
Nvidia       5
Microsoft    4
dtype: int64

In [16]:
ser1['Apple']

3

In [17]:
ser1 + ser2

Apple        NaN
Facebook     4.0
Google       2.0
Microsoft    8.0
Nvidia       NaN
dtype: float64

# DataFrames

In [18]:
from numpy.random import randn
np.random.seed (42)

In [19]:
df = pd.DataFrame(randn(5,3) , index = ['A','B','C','D','E'],columns = ['X','Y','Z'])

In [20]:
df

          X         Y         Z
A  0.496714 -0.138264  0.647689
B  1.523030 -0.234153 -0.234137
C  1.579213  0.767435 -0.469474
D  0.542560 -0.463418 -0.465730
E  0.241962 -1.913280 -1.724918

In [21]:
df ['Y']

A   -0.138264
B   -0.234153
C    0.767435
D   -0.463418
E   -1.913280
Name: Y, dtype: float64

In [22]:
df [['X','Z']]

          X         Z
A  0.496714  0.647689
B  1.523030 -0.234137
C  1.579213 -0.469474
D  0.542560 -0.465730
E  0.241962 -1.724918

In [23]:
# Not recommended
df.X

A    0.496714
B    1.523030
C    1.579213
D    0.542560
E    0.241962
Name: X, dtype: float64

In [24]:
type (df ['Y'])

pandas.core.series.Series

In [25]:
type (df)

pandas.core.frame.DataFrame

In [26]:
df

          X         Y         Z
A  0.496714 -0.138264  0.647689
B  1.523030 -0.234153 -0.234137
C  1.579213  0.767435 -0.469474
D  0.542560 -0.463418 -0.465730
E  0.241962 -1.913280 -1.724918

In [27]:
df ['new'] = df ['X'] + df['Y']

In [28]:
df

          X         Y         Z       new
A  0.496714 -0.138264  0.647689  0.358450
B  1.523030 -0.234153 -0.234137  1.288876
C  1.579213  0.767435 -0.469474  2.346648
D  0.542560 -0.463418 -0.465730  0.079142
E  0.241962 -1.913280 -1.724918 -1.671318

In [29]:
df.drop ('new', axis = 1)

          X         Y         Z
A  0.496714 -0.138264  0.647689
B  1.523030 -0.234153 -0.234137
C  1.579213  0.767435 -0.469474
D  0.542560 -0.463418 -0.465730
E  0.241962 -1.913280 -1.724918

In [30]:
df

          X         Y         Z       new
A  0.496714 -0.138264  0.647689  0.358450
B  1.523030 -0.234153 -0.234137  1.288876
C  1.579213  0.767435 -0.469474  2.346648
D  0.542560 -0.463418 -0.465730  0.079142
E  0.241962 -1.913280 -1.724918 -1.671318

In [31]:
df.drop ('new' , axis =1, inplace = True)

In [32]:
df

          X         Y         Z
A  0.496714 -0.138264  0.647689
B  1.523030 -0.234153 -0.234137
C  1.579213  0.767435 -0.469474
D  0.542560 -0.463418 -0.465730
E  0.241962 -1.913280 -1.724918

In [33]:
df.drop ('D', inplace = True)

In [34]:
df

          X         Y         Z
A  0.496714 -0.138264  0.647689
B  1.523030 -0.234153 -0.234137
C  1.579213  0.767435 -0.469474
E  0.241962 -1.913280 -1.724918